function [outputArg1,outputArg2] = my_gbmm_1067400(A,B);
%% Author: Ioannis Loudaros, ΑΜ:1067400
%% Version: 0.1     Date: 20/01/2023
% symbols_seq : Η ακολουθία συμβόλων που παραλαμβάνεται.
% Μ : Το πλήθος των συμβόλων.
% gray : Επιλογή για το αν η ακολουθία συμβόλων είναι κωδικοποιημένη
% κατά gray (1) ή όχι (0).
% chopped : bits της άρχικης ακολουθίας που αποκόπηκαν γιατί δεν μπορούσαν
% να γίνουν map. Θα προστεθούν απλά στο τέλος, αν δοθούν.
% bin_seq : Δυαδική ακολουθία που προκύπτει από τα σύμβολα.

outputArg1 = inputArg1;
outputArg2 = inputArg2;
end